Continued apply output from previous comment.
<details><summary>Show Output</summary>

```diff
-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "2775195517508396128" -> null
      - triggers = {
          - "filename"  = "builds/aa396856c56bc316f5429db8c17f42525a5333058192b85978c8cc8f4bb30bfe.zip"
          - "timestamp" = "1756111467153059000"
        } -> null
    }

  # module.sbeacon.module.lambda-getRuns.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getRuns"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:14",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:10",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getRuns.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6418485823427558169" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758162472545533800" -> "1758249673018873000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getRuns.null_resource.archive[0] (deposed object ead21274) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "1066526251903281085" -> null
      - triggers = {
          - "filename"  = "builds/88930b272de54490182522f38fc6eadca926dd71de4ff726cf3de04349617ecc.zip"
          - "timestamp" = "1756111467742392000"
        } -> null
    }

  # module.sbeacon.module.lambda-indexer.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-indexer"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:14",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:10",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-indexer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "915700741196699367" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758162473963620000" -> "1758249673325023000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-indexer.null_resource.archive[0] (deposed object ae3e3146) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "8216712083802810948" -> null
      - triggers = {
          - "filename"  = "builds/aa624c03dfdae7cc1b6f9061e4ad7e5605e073652e2540f56756ee4171caf5db.zip"
          - "timestamp" = "1756111466964541000"
        } -> null
    }

  # module.sbeacon.module.lambda-performQuery.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-performQuery"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_binaries_layer:10",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:14",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:10",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-performQuery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6727874176547646979" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758162472857891000" -> "1758249673175510800"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-performQuery.null_resource.archive[0] (deposed object ef8b6178) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "463124308843956021" -> null
      - triggers = {
          - "filename"  = "builds/ed9c4d15f50553a43a1fbe829043aee893846f7ad048b424e36c5ecf460120d1.zip"
          - "timestamp" = "1756111467762225000"
        } -> null
    }

  # module.sbeacon.module.lambda-splitQuery.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-splitQuery"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:14",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:10",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-splitQuery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7022520528595515891" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758162472724858000" -> "1758249672852691000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-splitQuery.null_resource.archive[0] (deposed object 5634d349) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "1098694622364436976" -> null
      - triggers = {
          - "filename"  = "builds/76408ab6569b18b2349025a9480461ae075f7db9418cd088256937bb57a8a8ac.zip"
          - "timestamp" = "1756111467366813800"
        } -> null
    }

  # module.sbeacon.module.lambda-submitDataset.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-submitDataset"
      ~ image_uri                      = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers@sha256:f8dd9fcb89067d7ca25ba3a0097abbed354bc318932314fd3ec25bc9ea212c16" -> (known after apply)
      ~ last_modified                  = "2025-09-18T02:36:15.000+0000" -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-updateFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-updateFiles"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_binaries_layer:10",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:14",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:10",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-updateFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "246867998557289780" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758162473925234000" -> "1758249673643318000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.python_libraries_layer.aws_lambda_layer_version.this[0] must be replaced
+/- resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:14" -> (known after apply)
      ~ code_sha256                 = "HncVP04J5IdNtlzUuvkTIjlUahduCrVqfT25oWkuPxU=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-09-18T04:08:41.356+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:14" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer" -> (known after apply)
      ~ s3_key                      = "builds/758a5cf4322d5633cd248f949e27259bcb25689506b56025e4ef89cfcbad66ae.zip" -> "builds/00872f7f0f46a9ca1b444b165065d07f5bdead9fa47b0069612ec2a3fab69052.zip" # forces replacement
      + s3_object_version           = (known after apply) # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      ~ source_code_size            = 24398862 -> (known after apply)
      ~ version                     = "14" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_libraries_layer.aws_lambda_layer_version.this[0] (deposed object 6dc36dc3) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_lambda_layer_version" "this" {
      - arn                         = "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:13" -> null
      - code_sha256                 = "j6k0ZtYHmMBI3Z2T9yd5io9BErCYIHYqkmwSInbHb1I=" -> null
      - compatible_architectures    = [] -> null
      - compatible_runtimes         = [
          - "python3.12",
        ] -> null
      - created_date                = "2025-09-18T02:31:22.392+0000" -> null
      - description                 = "python libraries" -> null
      - id                          = "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:13" -> null
      - layer_arn                   = "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer" -> null
      - layer_name                  = "sbeacon_backend_python_libraries_layer" -> null
      - region                      = "ap-southeast-3" -> null
      - s3_bucket                   = "gasi-lambda-layers-20250513021721893000000003" -> null
      - s3_key                      = "builds/146ce8c1c2211ece470966661adcfa55bfabfada5c69bc6001be022c8aefd799.zip" -> null
      - skip_destroy                = false -> null
      - source_code_size            = 24398600 -> null
      - version                     = "13" -> null
        # (5 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_libraries_layer.aws_lambda_layer_version.this[0] (deposed object f5bff3a6) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_lambda_layer_version" "this" {
      - arn                         = "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:12" -> null
      - code_sha256                 = "i/7ThOHl2+kyodyc5uJgOrNmCMMPN7xZPSGbpIcDIBc=" -> null
      - compatible_architectures    = [] -> null
      - compatible_runtimes         = [
          - "python3.12",
        ] -> null
      - created_date                = "2025-08-25T08:48:27.133+0000" -> null
      - description                 = "python libraries" -> null
      - id                          = "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:12" -> null
      - layer_arn                   = "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer" -> null
      - layer_name                  = "sbeacon_backend_python_libraries_layer" -> null
      - region                      = "ap-southeast-3" -> null
      - s3_bucket                   = "gasi-lambda-layers-20250513021721893000000003" -> null
      - s3_key                      = "builds/3561ae79de6e4055e129534af3823910859d2d0e4711b6a12881aa70715f8c36.zip" -> null
      - skip_destroy                = false -> null
      - source_code_size            = 24397892 -> null
      - version                     = "12" -> null
        # (5 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_libraries_layer.aws_s3_object.lambda_package[0] must be replaced
+/- resource "aws_s3_object" "lambda_package" {
      ~ arn                           = "arn:aws:s3:::gasi-lambda-layers-20250513021721893000000003/builds/758a5cf4322d5633cd248f949e27259bcb25689506b56025e4ef89cfcbad66ae.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "binary/octet-stream" -> (known after apply)
      ~ etag                          = "a090c620624014173e0a7d9993464a5d-5" -> (known after apply)
      ~ id                            = "gasi-lambda-layers-20250513021721893000000003/builds/758a5cf4322d5633cd248f949e27259bcb25689506b56025e4ef89cfcbad66ae.zip" -> (known after apply)
      ~ key                           = "builds/758a5cf4322d5633cd248f949e27259bcb25689506b56025e4ef89cfcbad66ae.zip" -> "builds/00872f7f0f46a9ca1b444b165065d07f5bdead9fa47b0069612ec2a3fab69052.zip" # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = "builds/758a5cf4322d5633cd248f949e27259bcb25689506b56025e4ef89cfcbad66ae.zip" -> "builds/00872f7f0f46a9ca1b444b165065d07f5bdead9fa47b0069612ec2a3fab69052.zip"
      - tags                          = {} -> null
      + version_id                    = (known after apply)
        # (14 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_libraries_layer.aws_s3_object.lambda_package[0] (deposed object 87ce8255) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_s3_object" "lambda_package" {
      - acl                           = "private" -> null
      - arn                           = "arn:aws:s3:::gasi-lambda-layers-20250513021721893000000003/builds/146ce8c1c2211ece470966661adcfa55bfabfada5c69bc6001be022c8aefd799.zip" -> null
      - bucket                        = "gasi-lambda-layers-20250513021721893000000003" -> null
      - bucket_key_enabled            = false -> null
      - content_type                  = "binary/octet-stream" -> null
      - etag                          = "e955d8d9d4d6ac72acc00ef0ea27d3ab-5" -> null
      - force_destroy                 = false -> null
      - id                            = "gasi-lambda-layers-20250513021721893000000003/builds/146ce8c1c2211ece470966661adcfa55bfabfada5c69bc6001be022c8aefd799.zip" -> null
      - key                           = "builds/146ce8c1c2211ece470966661adcfa55bfabfada5c69bc6001be022c8aefd799.zip" -> null
      - metadata                      = {} -> null
      - region                        = "ap-southeast-3" -> null
      - server_side_encryption        = "AES256" -> null
      - source                        = "builds/146ce8c1c2211ece470966661adcfa55bfabfada5c69bc6001be022c8aefd799.zip" -> null
      - storage_class                 = "ONEZONE_IA" -> null
      - tags                          = {} -> null
      - tags_all                      = {
          - "Environment" = "uat"
          - "NAME"        = "sbeacon-backend"
          - "Owner"       = "gaspi"
        } -> null
        # (14 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_libraries_layer.aws_s3_object.lambda_package[0] (deposed object dc315be3) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_s3_object" "lambda_package" {
      - acl                           = "private" -> null
      - arn                           = "arn:aws:s3:::gasi-lambda-layers-20250513021721893000000003/builds/3561ae79de6e4055e129534af3823910859d2d0e4711b6a12881aa70715f8c36.zip" -> null
      - bucket                        = "gasi-lambda-layers-20250513021721893000000003" -> null
      - bucket_key_enabled            = false -> null
      - content_type                  = "binary/octet-stream" -> null
      - etag                          = "66d3501d559cc4d1e2b2d59e27cb8117-5" -> null
      - force_destroy                 = false -> null
      - id                            = "gasi-lambda-layers-20250513021721893000000003/builds/3561ae79de6e4055e129534af3823910859d2d0e4711b6a12881aa70715f8c36.zip" -> null
      - key                           = "builds/3561ae79de6e4055e129534af3823910859d2d0e4711b6a12881aa70715f8c36.zip" -> null
      - metadata                      = {} -> null
      - region                        = "ap-southeast-3" -> null
      - server_side_encryption        = "AES256" -> null
      - source                        = "builds/3561ae79de6e4055e129534af3823910859d2d0e4711b6a12881aa70715f8c36.zip" -> null
      - storage_class                 = "ONEZONE_IA" -> null
      - tags                          = {} -> null
      - tags_all                      = {
          - "Environment" = "uat"
          - "NAME"        = "sbeacon-backend"
          - "Owner"       = "gaspi"
        } -> null
        # (14 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_libraries_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/layers/python_libraries/",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/00872f7f0f46a9ca1b444b165065d07f5bdead9fa47b0069612ec2a3fab69052.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/00872f7f0f46a9ca1b444b165065d07f5bdead9fa47b0069612ec2a3fab69052.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.python_libraries_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8387499352013748470" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/758a5cf4322d5633cd248f949e27259bcb25689506b56025e4ef89cfcbad66ae.zip" -> "builds/00872f7f0f46a9ca1b444b165065d07f5bdead9fa47b0069612ec2a3fab69052.zip"
          ~ "timestamp" = "1758168331025077200" -> "1758249689693942000"
        }
    }

  # module.sbeacon.module.python_libraries_layer.null_resource.archive[0] (deposed object 694ccc60) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "5872406833242066383" -> null
      - triggers = {
          - "filename"  = "builds/3561ae79de6e4055e129534af3823910859d2d0e4711b6a12881aa70715f8c36.zip"
          - "timestamp" = "1756111483687374200"
        } -> null
    }

  # module.sbeacon.module.python_libraries_layer.null_resource.archive[0] (deposed object 71729597) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "2605805055030014666" -> null
      - triggers = {
          - "filename"  = "builds/146ce8c1c2211ece470966661adcfa55bfabfada5c69bc6001be022c8aefd799.zip"
          - "timestamp" = "1758162488744781000"
        } -> null
    }

  # module.sbeacon.module.python_modules_layer.aws_lambda_layer_version.this[0] must be replaced
+/- resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:10" -> (known after apply)
      ~ code_sha256                 = "z2vfE89L+7gIMKLSYyRQgy2KGpL7hiOzYdKREVlxme8=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-09-18T02:30:59.911+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:10" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer" -> (known after apply)
      ~ s3_key                      = "builds/f2562525814e463b43d53a6636a777b84ec20802018b70d36d228f4f22e9e122.zip" -> "builds/31bd390644bc88a4847f305b766bb7715e608910273dd78df02bd957b09d02c3.zip" # forces replacement
      + s3_object_version           = (known after apply) # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      ~ source_code_size            = 120523 -> (known after apply)
      ~ version                     = "10" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_modules_layer.aws_lambda_layer_version.this[0] (deposed object 98e12c51) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_lambda_layer_version" "this" {
      - arn                         = "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:9" -> null
      - code_sha256                 = "tPhy3AhPs1GB5jppSj5ezhRSKVFJqq18K3yXrRVYrgY=" -> null
      - compatible_architectures    = [] -> null
      - compatible_runtimes         = [
          - "python3.12",
        ] -> null
      - created_date                = "2025-08-25T08:48:20.619+0000" -> null
      - description                 = "python libraries" -> null
      - id                          = "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:9" -> null
      - layer_arn                   = "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer" -> null
      - layer_name                  = "sbeacon_backend_python_modules_layer" -> null
      - region                      = "ap-southeast-3" -> null
      - s3_bucket                   = "gasi-lambda-layers-20250513021721893000000003" -> null
      - s3_key                      = "builds/0734f5877e1e9dad6e8bf79d27e9cb360903b26d528706e609ffd47b61ea9029.zip" -> null
      - skip_destroy                = false -> null
      - source_code_size            = 120494 -> null
      - version                     = "9" -> null
        # (5 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_modules_layer.aws_s3_object.lambda_package[0] must be replaced
+/- resource "aws_s3_object" "lambda_package" {
      ~ arn                           = "arn:aws:s3:::gasi-lambda-layers-20250513021721893000000003/builds/f2562525814e463b43d53a6636a777b84ec20802018b70d36d228f4f22e9e122.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "application/octet-stream" -> (known after apply)
      ~ etag                          = "21aaf27e802db30b71887f484e0782a9" -> (known after apply)
      ~ id                            = "gasi-lambda-layers-20250513021721893000000003/builds/f2562525814e463b43d53a6636a777b84ec20802018b70d36d228f4f22e9e122.zip" -> (known after apply)
      ~ key                           = "builds/f2562525814e463b43d53a6636a777b84ec20802018b70d36d228f4f22e9e122.zip" -> "builds/31bd390644bc88a4847f305b766bb7715e608910273dd78df02bd957b09d02c3.zip" # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = "builds/f2562525814e463b43d53a6636a777b84ec20802018b70d36d228f4f22e9e122.zip" -> "builds/31bd390644bc88a4847f305b766bb7715e608910273dd78df02bd957b09d02c3.zip"
      - tags                          = {} -> null
      + version_id                    = (known after apply)
        # (14 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_modules_layer.aws_s3_object.lambda_package[0] (deposed object 20cd83fe) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_s3_object" "lambda_package" {
      - acl                           = "private" -> null
      - arn                           = "arn:aws:s3:::gasi-lambda-layers-20250513021721893000000003/builds/0734f5877e1e9dad6e8bf79d27e9cb360903b26d528706e609ffd47b61ea9029.zip" -> null
      - bucket                        = "gasi-lambda-layers-20250513021721893000000003" -> null
      - bucket_key_enabled            = false -> null
      - content_type                  = "application/octet-stream" -> null
      - etag                          = "68fd54265ea1cf5ec94d3d6652b543c5" -> null
      - force_destroy                 = false -> null
      - id                            = "gasi-lambda-layers-20250513021721893000000003/builds/0734f5877e1e9dad6e8bf79d27e9cb360903b26d528706e609ffd47b61ea9029.zip" -> null
      - key                           = "builds/0734f5877e1e9dad6e8bf79d27e9cb360903b26d528706e609ffd47b61ea9029.zip" -> null
      - metadata                      = {} -> null
      - region                        = "ap-southeast-3" -> null
      - server_side_encryption        = "AES256" -> null
      - source                        = "builds/0734f5877e1e9dad6e8bf79d27e9cb360903b26d528706e609ffd47b61ea9029.zip" -> null
      - storage_class                 = "ONEZONE_IA" -> null
      - tags                          = {} -> null
      - tags_all                      = {
          - "Environment" = "uat"
          - "NAME"        = "sbeacon-backend"
          - "Owner"       = "gaspi"
        } -> null
        # (14 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_modules_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/shared_resources/python-modules/",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/31bd390644bc88a4847f305b766bb7715e608910273dd78df02bd957b09d02c3.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/31bd390644bc88a4847f305b766bb7715e608910273dd78df02bd957b09d02c3.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.python_modules_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5387680724935524444" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/f2562525814e463b43d53a6636a777b84ec20802018b70d36d228f4f22e9e122.zip" -> "builds/31bd390644bc88a4847f305b766bb7715e608910273dd78df02bd957b09d02c3.zip"
          ~ "timestamp" = "1758162474948396000" -> "1758249673262658200"
        }
    }

  # module.sbeacon.module.python_modules_layer.null_resource.archive[0] (deposed object dbe51a8e) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "1049456738398553898" -> null
      - triggers = {
          - "filename"  = "builds/0734f5877e1e9dad6e8bf79d27e9cb360903b26d528706e609ffd47b61ea9029.zip"
          - "timestamp" = "1756111466663596000"
        } -> null
    }

  # module.security.module.lambda-sendSecurityAlert.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8651298991935041406" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758162472241827000" -> "1758249673939659200"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.docker_image_pluginConsequence_lambda.docker_image.this must be replaced
+/- resource "docker_image" "this" {
      ~ id           = "sha256:784944a85c50ec9b852272940fff467b50a1af5363c9f692d08c513c6b857392460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers" -> (known after apply)
      ~ image_id     = "sha256:784944a85c50ec9b852272940fff467b50a1af5363c9f692d08c513c6b857392" -> (known after apply)
        name         = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers"
      ~ repo_digest  = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers@sha256:6a6c3b0038f02376243261db277dde60c596855ec1ada652cceacfe01b4ef889" -> (known after apply)
      ~ triggers     = { # forces replacement
          ~ "dir_sha" = "1c67e2765ed43960532cd4feff4f37d46b86dd86" -> "33480e606367a655d62f09b8cd6e11949fbda682"
        }
        # (2 unchanged attributes hidden)

      - build {
          - build_args      = {} -> null
          - cache_from      = [] -> null
          - context         = "svep/lambda/pluginConsequence" -> null
          - cpu_period      = 0 -> null
          - cpu_quota       = 0 -> null
          - cpu_shares      = 0 -> null
          - dockerfile      = "Dockerfile" -> null
          - extra_hosts     = [] -> null
          - force_remove    = false -> null
          - label           = {} -> null
          - labels          = {} -> null
          - memory          = 0 -> null
          - memory_swap     = 0 -> null
          - no_cache        = false -> null
          - platform        = "linux/amd64" -> null
          - pull_parent     = false -> null
          - remove          = true -> null
          - security_opt    = [] -> null
          - shm_size        = 0 -> null
          - squash          = false -> null
          - suppress_output = false -> null
          - tag             = [] -> null
            # (12 unchanged attributes hidden)
        }
      + build {
          + cache_from     = []
          + context        = "svep/lambda/pluginConsequence"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "linux/amd64"
          + remove         = true
          + security_opt   = []
          + tag            = []
            # (12 unchanged attributes hidden)
        }
    }

  # module.svep[0].module.docker_image_pluginConsequence_lambda.docker_registry_image.this must be replaced
+/- resource "docker_registry_image" "this" {
      ~ id                   = "sha256:6a6c3b0038f02376243261db277dde60c596855ec1ada652cceacfe01b4ef889" -> (known after apply)
        name                 = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers"
      ~ sha256_digest        = "sha256:6a6c3b0038f02376243261db277dde60c596855ec1ada652cceacfe01b4ef889" -> (known after apply)
      ~ triggers             = { # forces replacement
          ~ "dir_sha" = "1c67e2765ed43960532cd4feff4f37d46b86dd86" -> "33480e606367a655d62f09b8cd6e11949fbda682"
        }
        # (2 unchanged attributes hidden)
    }

  # module.svep[0].module.docker_image_qcFigures_lambda.docker_image.this must be replaced
+/- resource "docker_image" "this" {
      ~ id           = "sha256:86c6216e7d87d11a32ac12e03e7c93cd0e101af24629656ce9b40257fd509c99460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers" -> (known after apply)
      ~ image_id     = "sha256:86c6216e7d87d11a32ac12e03e7c93cd0e101af24629656ce9b40257fd509c99" -> (known after apply)
        name         = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers"
      ~ repo_digest  = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers@sha256:7432ace85e05f3f4fab8960016d2411abb3d87befd6c0f5a523c12752934b21a" -> (known after apply)
      ~ triggers     = { # forces replacement
          ~ "dir_sha" = "e58e9cea3a61426bad4537498e613baa40ae4b2a" -> "53c87c2adf72737131b4918ff33c93580b62b22e"
        }
        # (2 unchanged attributes hidden)

      - build {
          - build_args      = {
              - "SHARED_LAYER_PATH" = "svep/shared_resources/python-modules/python/shared"
            } -> null
          - cache_from      = [] -> null
          - context         = "svep/lambda/qcFigures" -> null
          - cpu_period      = 0 -> null
          - cpu_quota       = 0 -> null
          - cpu_shares      = 0 -> null
          - dockerfile      = "Dockerfile" -> null
          - extra_hosts     = [] -> null
          - force_remove    = false -> null
          - label           = {} -> null
          - labels          = {} -> null
          - memory          = 0 -> null
          - memory_swap     = 0 -> null
          - no_cache        = false -> null
          - platform        = "linux/amd64" -> null
          - pull_parent     = false -> null
          - remove          = true -> null
          - security_opt    = [] -> null
          - shm_size        = 0 -> null
          - squash          = false -> null
          - suppress_output = false -> null
          - tag             = [] -> null
            # (12 unchanged attributes hidden)
        }
      + build {
          + build_args     = {
              + "SHARED_LAYER_PATH" = "svep/shared_resources/python-modules/python/shared"
            }
          + cache_from     = []
          + context        = "svep/lambda/qcFigures"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "linux/amd64"
          + remove         = true
          + security_opt   = []
          + tag            = []
            # (12 unchanged attributes hidden)
        }
    }

  # module.svep[0].module.docker_image_qcFigures_lambda.docker_registry_image.this must be replaced
+/- resource "docker_registry_image" "this" {
      ~ id                   = "sha256:7432ace85e05f3f4fab8960016d2411abb3d87befd6c0f5a523c12752934b21a" -> (known after apply)
        name                 = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers"
      ~ sha256_digest        = "sha256:7432ace85e05f3f4fab8960016d2411abb3d87befd6c0f5a523c12752934b21a" -> (known after apply)
      ~ triggers             = { # forces replacement
          ~ "dir_sha" = "e58e9cea3a61426bad4537498e613baa40ae4b2a" -> "53c87c2adf72737131b4918ff33c93580b62b22e"
        }
        # (2 unchanged attributes hidden)
    }

  # module.svep[0].module.docker_image_qcFigures_lambda.docker_registry_image.this (deposed object 02d70864) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "docker_registry_image" "this" {
      - id                   = "sha256:5472cf0eab296dc8deab8e4e3e6af0cbf62b5d8ffef5f71915852fec454c4fd1" -> null
      - insecure_skip_verify = false -> null
      - keep_remotely        = false -> null
      - name                 = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers" -> null
      - sha256_digest        = "sha256:7432ace85e05f3f4fab8960016d2411abb3d87befd6c0f5a523c12752934b21a" -> null
      - triggers             = {
          - "dir_sha" = "d89093227325fa7ea1c3d445e2bd7934726d6ca0"
        } -> null
    }

  # module.svep[0].module.lambda-batchStarter.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-batchStarter"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:17",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-batchStarter.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8134589134119453362" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758162473730918000" -> "1758249688469647000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-batchSubmit.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-batchSubmit"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:17",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-batchSubmit.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7560956386625967781" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758162472265496000" -> "1758249689051910000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-batchSubmit.null_resource.archive[0] (deposed object 04170820) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "7909297504390108772" -> null
      - triggers = {
          - "filename"  = "builds/f2196129bfbee99ecf4aca7f82dcf5aab08821f9add856de80b9801d4f700067.zip"
          - "timestamp" = "1756111471769906000"
        } -> null
    }

  # module.svep[0].module.lambda-clearTempAndRegions.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1280236470133920915" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758162473046210000" -> "1758249688717456200"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-concat.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-concat"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:17",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-concat.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1044801428294880422" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758162471743676000" -> "1758249688551296000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-concatPages.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-concatPages"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:17",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-concatPages.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5761105775097779277" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758162472936353000" -> "1758249688531209000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-concatStarter.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-concatStarter"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:17",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-concatStarter.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1905083761411757977" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758162473128501000" -> "1758249688781478000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-createPages.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-createPages"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:17",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-createPages.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1031823679640956384" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758162473449449000" -> "1758249688407360000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-deleteClinicalWorkflow.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-deleteClinicalWorkflow"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_binaries_layer:11",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:17",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-deleteClinicalWorkflow.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "831292757022756766" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758162473572849000" -> "1758249688300942800"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-formatOutput.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/e7b5e04fc1f308dfcadd91986df8765b81447b92082c3ed0ca153bca322b0a79.zip" -> "builds/043d433a265fb61267a1d18feb51e7cea2e190ed1002f8947df9489063e4bd9d.zip"
        id                             = "svep-backend-formatOutput"
      ~ last_modified                  = "2025-09-18T04:09:35.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:17",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-formatOutput.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "svep/lambda/formatOutput",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/043d433a265fb61267a1d18feb51e7cea2e190ed1002f8947df9489063e4bd9d.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/043d433a265fb61267a1d18feb51e7cea2e190ed1002f8947df9489063e4bd9d.plan.json"
      + id                   = (known after apply)
    }

  # module.svep[0].module.lambda-formatOutput.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7151886515801202329" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/e7b5e04fc1f308dfcadd91986df8765b81447b92082c3ed0ca153bca322b0a79.zip" -> "builds/043d433a265fb61267a1d18feb51e7cea2e190ed1002f8947df9489063e4bd9d.zip"
          ~ "timestamp" = "1758162473653501000" -> "1758249688921578800"
        }
    }

  # module.svep[0].module.lambda-getResultsURL.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-getResultsURL"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:17",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-getResultsURL.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6326550553961423041" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758162474435986000" -> "1758249688392704000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-getResultsURL.null_resource.archive[0] (deposed object cedd1070) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "4509652308501032224" -> null
      - triggers = {
          - "filename"  = "builds/dbf46123a8a5c0d713d746ad3c23e8bf26d84a39a32d052a473dc7c1116f5191.zip"
          - "timestamp" = "1756111472429896200"
        } -> null
    }

  # module.svep[0].module.lambda-initQuery.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-initQuery"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_binaries_layer:11",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:17",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-initQuery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5939637829075640427" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758162472919303000" -> "1758249689040241000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-initQuery.null_resource.archive[0] (deposed object 9035b989) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "136244236526779431" -> null
      - triggers = {
          - "filename"  = "builds/949b43e6d8737b29b6fbf3b078adba05455ab5cebab437aaa6c6a9c4e30f399e.zip"
          - "timestamp" = "1756111472029106000"
        } -> null
    }

  # module.svep[0].module.lambda-pluginClinvar.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-pluginClinvar"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_binaries_layer:11",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:17",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-pluginClinvar.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4133450959732263947" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758162472133227200" -> "1758249688659776000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-pluginConsequence.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-pluginConsequence"
      ~ image_uri                      = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers@sha256:6a6c3b0038f02376243261db277dde60c596855ec1ada652cceacfe01b4ef889" -> (known after apply)
      ~ last_modified                  = "2025-09-18T02:33:13.000+0000" -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-pluginGnomad.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-pluginGnomad"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_binaries_layer:11",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:17",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-pluginGnomad.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5968924290460716664" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758162473859124000" -> "1758249689032835000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-pluginGnomadConstraint.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-pluginGnomadConstraint"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_binaries_layer:11",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:17",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-pluginGnomadConstraint.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "655828281715019771" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758162472948857000" -> "1758249687960180000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-pluginGnomadOneKG.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/7b4867088cabd4e44f7dc896e0d01710ecd3f8aa4478f82846dab0a7740f9cae.zip" -> "builds/7638974d6180381f44e730fe5b2ff34364a2b0655de7ef2f09b72141e8120ddf.zip"
        id                             = "svep-backend-pluginGnomadOneKG"
      ~ last_modified                  = "2025-09-18T04:09:24.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_binaries_layer:11",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:17",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-pluginGnomadOneKG.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "svep/lambda/pluginGnomadOneKG",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/7638974d6180381f44e730fe5b2ff34364a2b0655de7ef2f09b72141e8120ddf.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/7638974d6180381f44e730fe5b2ff34364a2b0655de7ef2f09b72141e8120ddf.plan.json"
      + id                   = (known after apply)
    }

  # module.svep[0].module.lambda-pluginGnomadOneKG.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1785702948850392397" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/7b4867088cabd4e44f7dc896e0d01710ecd3f8aa4478f82846dab0a7740f9cae.zip" -> "builds/7638974d6180381f44e730fe5b2ff34364a2b0655de7ef2f09b72141e8120ddf.zip"
          ~ "timestamp" = "1758162473022477000" -> "1758249688046722800"
        }
    }

  # module.svep[0].module.lambda-qcFigures.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-qcFigures"
      ~ image_uri                      = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers@sha256:7432ace85e05f3f4fab8960016d2411abb3d87befd6c0f5a523c12752934b21a" -> (known after apply)
      ~ last_modified                  = "2025-09-18T02:46:47.000+0000" -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-qcNotes.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-qcNotes"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:17",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-qcNotes.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "3858218232790927018" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758162473541483000" -> "1758249688923852000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-qcNotes.null_resource.archive[0] (deposed object 518908ce) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "1612385254487562686" -> null
      - triggers = {
          - "filename"  = "builds/7bb413b7579a5a9ccb874b45fe277268f7765ee27a3c08ee225800932d871c7c.zip"
          - "timestamp" = "1756111472514987000"
        } -> null
    }

  # module.svep[0].module.lambda-queryGTF.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-queryGTF"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_binaries_layer:11",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:17",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-queryGTF.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2804917570928564744" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758162473379118000" -> "1758249687872545000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-queryVCF.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-queryVCF"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_binaries_layer:11",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:17",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-queryVCF.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5865945383468324053" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "time
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.